In [4]:
# Dependencies
import pandas as pd

In [5]:
# Save path to data set in a variable
data_file = "Resources/dataSet.csv"

In [6]:
# Use Pandas to read data
data_file_pd = pd.read_csv(data_file)
data_file_pd.head()

   id First Name Last Name Gender   Amount
0   1       Todd     Lopez      M   8067.7
1   2     Joshua     White      M   7330.1
2   3       Mary     Lewis      F  16335.0
3   4      Emily     Burns      F  12460.8
4   5  Christina    Romero      F  15271.9

In [ ]:
# Reference multiple columns within a DataFrame
data_file_pd[["Amount", "Gender"]].head()

In [7]:
# Display a statistical overview of the DataFrame
data_file_pd.describe()

                id        Amount
count  1000.000000   1000.000000
mean    500.500000  10051.323600
std     288.819436   5831.230806
min       1.000000      3.400000
25%     250.750000   4854.875000
50%     500.500000  10318.050000
75%     750.250000  15117.425000
max    1000.000000  19987.400000

In [ ]:
# Reference a single column within a DataFrame
data_file_pd["Amount"].head()

In [ ]:
# The mean method averages the series
average = data_file_pd["Amount"].mean()
average

In [9]:
# The sum method adds every entry in the series
total = data_file_pd["Amount"].sum()
total

10051323.600000001

In [15]:
# The unique method shows every element of the series that appears only once
unique = data_file_pd["Last Name"].unique()
unique

count1 = data_file_pd["Last Name"].value_counts()
count1

Tucker      10
Wright       9
Kelly        9
Mcdonald     9
Kelley       8
            ..
Carr         1
Black        1
Brown        1
Fields       1
Holmes       1
Name: Last Name, Length: 242, dtype: int64

In [10]:
# The value_counts method counts unique values in a column
count = data_file_pd["Gender"].value_counts()
count

M    515
F    485
Name: Gender, dtype: int64

In [12]:
# Calculations can also be performed on Series and added into DataFrames as new columns
thousands_of_dollars = data_file_pd["Amount"]/1000 

# Adding a new column with header "Thousands of Dollars"
data_file_pd["Thousands of Dollars"] = thousands_of_dollars

data_file_pd.head()

   id First Name Last Name Gender   Amount  Thousands of Dollars
0   1       Todd     Lopez      M   8067.7                8.0677
1   2     Joshua     White      M   7330.1                7.3301
2   3       Mary     Lewis      F  16335.0               16.3350
3   4      Emily     Burns      F  12460.8               12.4608
4   5  Christina    Romero      F  15271.9               15.2719